# Python fstring 字串格式化

price_1 = 3.321
price_2 = -77
price_3 = 15.11

# 小數點的精確度
print(f"小數點的精確度-------------\n"
      f"價格1為 {price_1:.2f}\n"
      f"價格2為 {price_2:.2f}\n"
      f"價格3為 {price_3:.2f}\n"
      )
# 加上正負號
print(f"加上正負號-------------\n"
      f"價格1為 {price_1:+.2f}\n"
      f"價格2為 {price_2:+.2f}\n"
      f"價格3為 {price_3:+.2f}\n"
      )

# 對齊 <>^
print(f"對齊(預設為向右對齊)-------------\n"
      f"價格1為 {price_1:10.2f}\n"
      f"價格2為 {price_2:10.2f}\n"
      f"價格3為 {price_3:10.2f}\n"
      )
print(f"對齊加上<為向左對齊-------------\n"
      f"價格1為 {price_1:<10.2f}\n"
      f"價格2為 {price_2:<10.2f}\n"
      f"價格3為 {price_3:<10.2f}\n"
      )
print(f"對齊加上>為向右對齊-------------\n"
      f"價格1為 {price_1:>10.2f}\n"
      f"價格2為 {price_2:>10.2f}\n"
      f"價格3為 {price_3:>10.2f}\n"
      )
print(f"對齊加上^為置中對齊-------------\n"
      f"價格1為 {price_1:^10.2f}\n"
      f"價格2為 {price_2:^10.2f}\n"
      f"價格3為 {price_3:^10.2f}\n"
      )
# 混用不同符號
print(f"對齊加上混用不同符號(>&+)-------------\n"
      f"價格1為 {price_1:>+.2f}\n"
      f"價格2為 {price_2:>+.2f}\n"
      f"價格3為 {price_3:>+.2f}\n"
      )


